Revit 2015 API
Material.SurfacePatternId Property
 Gets and sets the surface fill pattern element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public ElementId SurfacePatternId { get; set; }
Visual Basic
Public Property SurfacePatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SurfacePatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
Material Class
Autodesk.Revit.DB Namespace